app/views/task_categories/_task_category_new.html.erb


   	<% Task.where(:task_category_id => task_category.id).each do |task| %>
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."task_category_id" = 1


    <% TaskCategory.where(:task_category_id => task_category.id).each do |child_task_category| %>
---
SELECT "task_categories".* FROM "task_categories" WHERE "task_categories"."task_category_id" IS NULL