app/views/task_categories/show.html.erb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."task_category_id" = 3
---
	<h2>Tasks</h2>
   	<% Task.where(:task_category_id => @task_category.id).each do |task| %>