app/views/tasks/index.html.erb

SELECT "task_categories".* FROM "task_categories" WHERE "task_categories"."id" = ? LIMIT 1  [["id", 3]]
---
  	if task.category_id != nil
  		category = Category.find(task.category_id)