app/controllers/task_categories_controller.rb

  def index
    #@task_categories = TaskCategory.all

    @root_task_category = TaskCategory.where(:task_category_id => nil)
---
SELECT "task_categories".* FROM "task_categories" WHERE "task_categories"."task_category_id" IS NULL

  def show
    @task_category = TaskCategory.find(params[:id])
---
SELECT "task_categories".* FROM "task_categories" WHERE "task_categories"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @task_category = TaskCategory.find(params[:id])
---
SELECT "task_categories".* FROM "task_categories" WHERE "task_categories"."id" = ? LIMIT 1  [["id", "2"]]

  def create
    @task_category = TaskCategory.new(params[:task_category])

    respond_to do |format|
      if @task_category.save
---
INSERT INTO "task_categories" ("created_at", "name", "task_category_id", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Fri, 14 Sep 2012 02:16:27 UTC +00:00], ["name", "test"], ["task_category_id", nil], ["updated_at", Fri, 14 Sep 2012 02:16:27 UTC +00:00]]

  def destroy
    @task_category = TaskCategory.find(params[:id])

    #delete children
    destroy_task_category_and_ancestors(@task_category)

    @task_category.destroy
---
SELECT "task_categories".* FROM "task_categories" WHERE "task_categories"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "task_categories" WHERE "task_categories"."id" = ?  [["id", 2]]