app/controllers/tasks_controller.rb

  def index
    sort_by = "id"
    if defined? params[:sort_by]
      sort_by = params[:sort_by]
    end

    @tasks = Task.all(:order => sort_by)
---
SELECT "tasks".* FROM "tasks" ORDER BY priority

  def show
    @task = Task.find(params[:id])

    @user_email = ""
    if @task.user
      @user_email = @task.user.email
    end

    @assigned_user_email = ""
    if @task.assigned_user_id != nil
      @assigned_user_email = User.find(@task.assigned_user_id).email
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1

  def create
    @task = Task.new(params[:task])
    @task.user = current_user #owner

    #let's tell the assigned user about this task
    UserMailer.add_user_to_task(User.find(params[:task][:assigned_user_id]),@task).deliver

    respond_to do |format|
      if @task.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
INSERT INTO "tasks" ("act_hour", "act_minute", "created_at", "est_hour", "est_minute", "name", "priority", "task_category_id", "task_desc", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @task = Task.find(params[:id])

    #add add_time to the task act_time
    if @task[:act_hour] == nil
      @task[:act_hour] = 0
    end
    if @task[:act_minute] == nil
      @task[:act_minute] = 0
    end

    minutes =
      params["task"][:act_minute].to_i + params[:add_minute].to_i

    #carry over minutes to hours
    carry_hours = minutes / 60

    params["task"][:act_minute] = minutes.remainder(60)

    params["task"][:act_hour] =
      (params["task"][:act_hour].to_i + params[:add_hour].to_i + carry_hours).to_s

    #let's tell the assigned user about this task
    if @task.assigned_user_id != params[:task][:assigned_user_id]
      UserMailer.add_user_to_task(User.find(params[:task][:assigned_user_id]),@task).deliver
    end

    respond_to do |format|
      if @task.update_attributes(params[:task])
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", "2"]]
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
UPDATE "tasks" SET "est_time" = '2000-01-01 00:00:00.000000', "act_time" = '2000-01-01 00:00:00.000000', "updated_at" = '2012-09-11 01:46:58.238439' WHERE "tasks"."id" = 2

  def destroy
    @task = Task.find(params[:id])
    category = @task.category

    @task.destroy
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 1]]